app/controllers/appointments_controller.rb

  def doctor_list
    @doctors= Doctor.all
---
SELECT "doctors".* FROM "doctors" ORDER BY "doctors"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def index
    if doctor_signed_in?
      @appointments = current_doctor.appointments
    elsif patient_signed_in?
      @appointments = current_patient.appointments
    else
      @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 2]]

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("date_time", "created_at", "updated_at", "doctor_id", "patient_id") VALUES (?, ?, ?, ?, ?)  [["date_time", "2021-10-04 11:28:00"], ["created_at", "2021-10-04 11:28:20.802392"], ["updated_at", "2021-10-04 11:28:20.802392"], ["doctor_id", 2], ["patient_id", 2]]

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 14]]